package com.example.lifecyclehw1

class MassInfo {

    val massInfoFirst = "Дефицит\n" +
            "Недостаточный BMI для мужчин и женщин — 16-18,5. При меньшем показателе дефицит массы " +
            "тела считается выраженным, что влечет за собой:\n" +
            "\n" +
            "хрупкость костей, у женщин — аменорею, анорексию;\n" +
            "изменение гормонального фона;\n" +
            "недостаточную выработку желчи, из-за чего пища хуже переваривается, усваивается.\n" +
            "Как бороться?\n" +
            "Единственный способ поправиться — больше кушать. Наращивать объемы лучше с добавлением " +
            "в рацион высококалорийных продуктов — орехов, сложных углеводов, молока, кефира, творога. " +
            "Для поднятия веса лучше прибегать к силовым тренировкам.\n" +
            "\n" +
            "Эффективным будет добавление витаминов и БАДов. Однако важно проконсультироваться с лечащим" +
            " врачом, чтобы он определил, каких именно полезных веществ не хватает организму. Безопасный" +
            " и быстрый способ повысить вес — прием пивных дрожжей. Для улучшения пищеварения врач может" +
            " порекомендовать пробиотики."

    val massInfoSecond = "Вам следовало бы больше есть белков и углеводов для набора массы: а так же" +
            "больше занятий спортом"

    val massInfoThree = "У Вас все в порядке: питайтесь и занимайтесь спортом так же"

    val massInfoFour = "Избыточный вес\n" +
            "Индекс массы тела 25-29,9 говорит о необходимости коррекции веса. В противном случае " +
            "есть риск развития гипертонии, болезней сердца, сахарного диабета.\n" +
            "\n" +
            "Как бороться?\n" +
            "Иногда достаточно скорректировать образ жизни, питание:\n" +
            "\n" +
            "отказаться от любого алкоголя;\n" +
            "увеличить потребление фруктов, овощей;\n" +
            "уменьшить количество калорий;\n" +
            "заниматься спортом минимум 150 минут в неделю.\n" +
            "Поддерживать организм в тонусе помогают зеленые, травяные чаи, цитрусовые фрукты, " +
            "кисломолочные продукты жирностью не более 2,5%."

    val massInfoFive = "Если BMI находится в диапазоне 30-34,9, говорят об ожирении. Избыточная " +
            "масса тела часто вызывает диабет, патологии сердечно-сосудистой системы, нарушение" +
            " обмена веществ. Человек может ощущать одышку при подъеме по лестнице, быстро" +
            " утомляться, постоянно чувствовать сонливость. Его настроение, аппетит могут " +
            "быстро меняться.\n" +
            "\n" +
            "Как бороться?\n" +
            "Ожирение требует не просто коррекции образа жизни. Врач должен выяснить корень " +
            "проблемы, назначить лечение. Причиной может быть как банальное переедание, так" +
            " и гормональный сбой. Наряду с соответствующими лекарствами эффективным будет " +
            "прием витаминов для коррекции веса. Их подбором должен заниматься лечащий врач " +
            "или диетолог."

    val massInfoSix = "Ожирение II степени\n" +
            "Характерно для людей с индексом 35-39,9. Риск развития заболеваний, перечисленных выше," +
            " внезапного летального исхода ВОЗ оценивает как резко повышенный.\n" +
            "\n" +
            "Как бороться?\n" +
            "Кроме коррекции питания, физических нагрузок врач должен назначить лечение в" +
            " соответствии с причиной ожирения. Это могут быть как пищевые привычки, " +
            "малоактивный образ жизни, так и гормонально-эндокринные заболевания, " +
            "а у женщин — синдром поликистозных яичников. В большинстве случаев назначают" +
            " препараты для нормализации обмена веществ."

    val massInfoSeven = "Ожирение III степени\n" +
            "Это морбидное ожирение, при котором ИМТ выше 40. В этом состоянии риск тяжелых" +
            " патологий, летального исхода чрезвычайно высок. Происходит развитие клинических " +
            "состояний, страдают кости, суставы, мышцы.\n" +
            "\n" +
            "Как бороться?\n" +
            "Победить ожирение высокой степени можно только комплексом мер, силой воли. Необходима " +
            "лекарственная терапия, направленная на устранение причин, сопутствующих заболеваний, а" +
            " также постепенное изменение пищевых привычек.\n" +
            "\n" +
            "Бороться с лишним весом — тяжелая работа, поэтому следите за питанием, занимайтесь " +
            "спортом, больше двигайтесь и будьте здоровы!"
}